Autodesk.Revit.DB.ModelCurveNode.LineProperties
Access to the line (pen) properties of the curve being drawn
Since:
2016

Autodesk.Revit.DB.ModelCurveNode
A base class of output nodes that represent various model curves.
Since:
2016